// Generated by jextract

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct camera {
 *     _Bool valid;
 *     wchar_t friendlyName[1024];
 *     wchar_t devicePath[1024];
 *     _Bool panSupported;
 *     int32_t panMinimum;
 *     int32_t panMaximum;
 *     int32_t panDefault;
 *     int32_t panStepSize;
 *     _Bool panAutomaticAllowed;
 *     _Bool panManualAllowed;
 *     _Bool tiltSupported;
 *     int32_t tiltMinimum;
 *     int32_t tiltMaximum;
 *     int32_t tiltDefault;
 *     int32_t tiltStepSize;
 *     _Bool tiltAutomaticAllowed;
 *     _Bool tiltManualAllowed;
 *     _Bool rollSupported;
 *     int32_t rollMinimum;
 *     int32_t rollMaximum;
 *     int32_t rollDefault;
 *     int32_t rollStepSize;
 *     _Bool rollAutomaticAllowed;
 *     _Bool rollManualAllowed;
 *     _Bool zoomSupported;
 *     int32_t zoomMinimum;
 *     int32_t zoomMaximum;
 *     int32_t zoomDefault;
 *     int32_t zoomStepSize;
 *     _Bool zoomAutomaticAllowed;
 *     _Bool zoomManualAllowed;
 *     _Bool exposureSupported;
 *     int32_t exposureMinimum;
 *     int32_t exposureMaximum;
 *     int32_t exposureDefault;
 *     int32_t exposureStepSize;
 *     _Bool exposureAutomaticAllowed;
 *     _Bool exposureManualAllowed;
 *     _Bool irisSupported;
 *     int32_t irisMinimum;
 *     int32_t irisMaximum;
 *     int32_t irisDefault;
 *     int32_t irisStepSize;
 *     _Bool irisAutomaticAllowed;
 *     _Bool irisManualAllowed;
 *     _Bool focusSupported;
 *     int32_t focusMinimum;
 *     int32_t focusMaximum;
 *     int32_t focusDefault;
 *     int32_t focusStepSize;
 *     _Bool focusAutomaticAllowed;
 *     _Bool focusManualAllowed;
 *     _Bool brightnessSupported;
 *     int32_t brightnessMinimum;
 *     int32_t brightnessMaximum;
 *     int32_t brightnessDefault;
 *     int32_t brightnessStepSize;
 *     _Bool brightnessAutomaticAllowed;
 *     _Bool brightnessManualAllowed;
 *     _Bool contrastSupported;
 *     int32_t contrastMinimum;
 *     int32_t contrastMaximum;
 *     int32_t contrastDefault;
 *     int32_t contrastStepSize;
 *     _Bool contrastAutomaticAllowed;
 *     _Bool contrastManualAllowed;
 *     _Bool hueSupported;
 *     int32_t hueMinimum;
 *     int32_t hueMaximum;
 *     int32_t hueDefault;
 *     int32_t hueStepSize;
 *     _Bool hueAutomaticAllowed;
 *     _Bool hueManualAllowed;
 *     _Bool saturationSupported;
 *     int32_t saturationMinimum;
 *     int32_t saturationMaximum;
 *     int32_t saturationDefault;
 *     int32_t saturationStepSize;
 *     _Bool saturationAutomaticAllowed;
 *     _Bool saturationManualAllowed;
 *     _Bool sharpnessSupported;
 *     int32_t sharpnessMinimum;
 *     int32_t sharpnessMaximum;
 *     int32_t sharpnessDefault;
 *     int32_t sharpnessStepSize;
 *     _Bool sharpnessAutomaticAllowed;
 *     _Bool sharpnessManualAllowed;
 *     _Bool gammaSupported;
 *     int32_t gammaMinimum;
 *     int32_t gammaMaximum;
 *     int32_t gammaDefault;
 *     int32_t gammaStepSize;
 *     _Bool gammaAutomaticAllowed;
 *     _Bool gammaManualAllowed;
 *     _Bool colorSupported;
 *     _Bool colorDefault;
 *     _Bool whiteBalanceSupported;
 *     int32_t whiteBalanceMinimum;
 *     int32_t whiteBalanceMaximum;
 *     int32_t whiteBalanceDefault;
 *     int32_t whiteBalanceStepSize;
 *     _Bool whiteBalanceAutomaticAllowed;
 *     _Bool whiteBalanceManualAllowed;
 *     _Bool backlightCompensationSupported;
 *     _Bool backlightCompensationDefault;
 *     _Bool gainSupported;
 *     int32_t gainMinimum;
 *     int32_t gainMaximum;
 *     int32_t gainDefault;
 *     int32_t gainStepSize;
 *     _Bool gainAutomaticAllowed;
 *     _Bool gainManualAllowed;
 *     int32_t configsCount;
 *     int32_t configHandle[32];
 *     int32_t configWidth[32];
 *     int32_t configHeight[32];
 *     int64_t configMinInterval[32];
 *     int64_t configMaxInterval[32];
 *     int16_t configColorDepth[32];
 *     int32_t configFourCC[32];
 * }
 * }
 */
public class camera {

    camera() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        WebcamDLL.C_BOOL.withName("valid"),
        MemoryLayout.paddingLayout(1),
        MemoryLayout.sequenceLayout(1024, WebcamDLL.C_SHORT).withName("friendlyName"),
        MemoryLayout.sequenceLayout(1024, WebcamDLL.C_SHORT).withName("devicePath"),
        WebcamDLL.C_BOOL.withName("panSupported"),
        MemoryLayout.paddingLayout(1),
        WebcamDLL.C_INT.withName("panMinimum"),
        WebcamDLL.C_INT.withName("panMaximum"),
        WebcamDLL.C_INT.withName("panDefault"),
        WebcamDLL.C_INT.withName("panStepSize"),
        WebcamDLL.C_BOOL.withName("panAutomaticAllowed"),
        WebcamDLL.C_BOOL.withName("panManualAllowed"),
        WebcamDLL.C_BOOL.withName("tiltSupported"),
        MemoryLayout.paddingLayout(1),
        WebcamDLL.C_INT.withName("tiltMinimum"),
        WebcamDLL.C_INT.withName("tiltMaximum"),
        WebcamDLL.C_INT.withName("tiltDefault"),
        WebcamDLL.C_INT.withName("tiltStepSize"),
        WebcamDLL.C_BOOL.withName("tiltAutomaticAllowed"),
        WebcamDLL.C_BOOL.withName("tiltManualAllowed"),
        WebcamDLL.C_BOOL.withName("rollSupported"),
        MemoryLayout.paddingLayout(1),
        WebcamDLL.C_INT.withName("rollMinimum"),
        WebcamDLL.C_INT.withName("rollMaximum"),
        WebcamDLL.C_INT.withName("rollDefault"),
        WebcamDLL.C_INT.withName("rollStepSize"),
        WebcamDLL.C_BOOL.withName("rollAutomaticAllowed"),
        WebcamDLL.C_BOOL.withName("rollManualAllowed"),
        WebcamDLL.C_BOOL.withName("zoomSupported"),
        MemoryLayout.paddingLayout(1),
        WebcamDLL.C_INT.withName("zoomMinimum"),
        WebcamDLL.C_INT.withName("zoomMaximum"),
        WebcamDLL.C_INT.withName("zoomDefault"),
        WebcamDLL.C_INT.withName("zoomStepSize"),
        WebcamDLL.C_BOOL.withName("zoomAutomaticAllowed"),
        WebcamDLL.C_BOOL.withName("zoomManualAllowed"),
        WebcamDLL.C_BOOL.withName("exposureSupported"),
        MemoryLayout.paddingLayout(1),
        WebcamDLL.C_INT.withName("exposureMinimum"),
        WebcamDLL.C_INT.withName("exposureMaximum"),
        WebcamDLL.C_INT.withName("exposureDefault"),
        WebcamDLL.C_INT.withName("exposureStepSize"),
        WebcamDLL.C_BOOL.withName("exposureAutomaticAllowed"),
        WebcamDLL.C_BOOL.withName("exposureManualAllowed"),
        WebcamDLL.C_BOOL.withName("irisSupported"),
        MemoryLayout.paddingLayout(1),
        WebcamDLL.C_INT.withName("irisMinimum"),
        WebcamDLL.C_INT.withName("irisMaximum"),
        WebcamDLL.C_INT.withName("irisDefault"),
        WebcamDLL.C_INT.withName("irisStepSize"),
        WebcamDLL.C_BOOL.withName("irisAutomaticAllowed"),
        WebcamDLL.C_BOOL.withName("irisManualAllowed"),
        WebcamDLL.C_BOOL.withName("focusSupported"),
        MemoryLayout.paddingLayout(1),
        WebcamDLL.C_INT.withName("focusMinimum"),
        WebcamDLL.C_INT.withName("focusMaximum"),
        WebcamDLL.C_INT.withName("focusDefault"),
        WebcamDLL.C_INT.withName("focusStepSize"),
        WebcamDLL.C_BOOL.withName("focusAutomaticAllowed"),
        WebcamDLL.C_BOOL.withName("focusManualAllowed"),
        WebcamDLL.C_BOOL.withName("brightnessSupported"),
        MemoryLayout.paddingLayout(1),
        WebcamDLL.C_INT.withName("brightnessMinimum"),
        WebcamDLL.C_INT.withName("brightnessMaximum"),
        WebcamDLL.C_INT.withName("brightnessDefault"),
        WebcamDLL.C_INT.withName("brightnessStepSize"),
        WebcamDLL.C_BOOL.withName("brightnessAutomaticAllowed"),
        WebcamDLL.C_BOOL.withName("brightnessManualAllowed"),
        WebcamDLL.C_BOOL.withName("contrastSupported"),
        MemoryLayout.paddingLayout(1),
        WebcamDLL.C_INT.withName("contrastMinimum"),
        WebcamDLL.C_INT.withName("contrastMaximum"),
        WebcamDLL.C_INT.withName("contrastDefault"),
        WebcamDLL.C_INT.withName("contrastStepSize"),
        WebcamDLL.C_BOOL.withName("contrastAutomaticAllowed"),
        WebcamDLL.C_BOOL.withName("contrastManualAllowed"),
        WebcamDLL.C_BOOL.withName("hueSupported"),
        MemoryLayout.paddingLayout(1),
        WebcamDLL.C_INT.withName("hueMinimum"),
        WebcamDLL.C_INT.withName("hueMaximum"),
        WebcamDLL.C_INT.withName("hueDefault"),
        WebcamDLL.C_INT.withName("hueStepSize"),
        WebcamDLL.C_BOOL.withName("hueAutomaticAllowed"),
        WebcamDLL.C_BOOL.withName("hueManualAllowed"),
        WebcamDLL.C_BOOL.withName("saturationSupported"),
        MemoryLayout.paddingLayout(1),
        WebcamDLL.C_INT.withName("saturationMinimum"),
        WebcamDLL.C_INT.withName("saturationMaximum"),
        WebcamDLL.C_INT.withName("saturationDefault"),
        WebcamDLL.C_INT.withName("saturationStepSize"),
        WebcamDLL.C_BOOL.withName("saturationAutomaticAllowed"),
        WebcamDLL.C_BOOL.withName("saturationManualAllowed"),
        WebcamDLL.C_BOOL.withName("sharpnessSupported"),
        MemoryLayout.paddingLayout(1),
        WebcamDLL.C_INT.withName("sharpnessMinimum"),
        WebcamDLL.C_INT.withName("sharpnessMaximum"),
        WebcamDLL.C_INT.withName("sharpnessDefault"),
        WebcamDLL.C_INT.withName("sharpnessStepSize"),
        WebcamDLL.C_BOOL.withName("sharpnessAutomaticAllowed"),
        WebcamDLL.C_BOOL.withName("sharpnessManualAllowed"),
        WebcamDLL.C_BOOL.withName("gammaSupported"),
        MemoryLayout.paddingLayout(1),
        WebcamDLL.C_INT.withName("gammaMinimum"),
        WebcamDLL.C_INT.withName("gammaMaximum"),
        WebcamDLL.C_INT.withName("gammaDefault"),
        WebcamDLL.C_INT.withName("gammaStepSize"),
        WebcamDLL.C_BOOL.withName("gammaAutomaticAllowed"),
        WebcamDLL.C_BOOL.withName("gammaManualAllowed"),
        WebcamDLL.C_BOOL.withName("colorSupported"),
        WebcamDLL.C_BOOL.withName("colorDefault"),
        WebcamDLL.C_BOOL.withName("whiteBalanceSupported"),
        MemoryLayout.paddingLayout(3),
        WebcamDLL.C_INT.withName("whiteBalanceMinimum"),
        WebcamDLL.C_INT.withName("whiteBalanceMaximum"),
        WebcamDLL.C_INT.withName("whiteBalanceDefault"),
        WebcamDLL.C_INT.withName("whiteBalanceStepSize"),
        WebcamDLL.C_BOOL.withName("whiteBalanceAutomaticAllowed"),
        WebcamDLL.C_BOOL.withName("whiteBalanceManualAllowed"),
        WebcamDLL.C_BOOL.withName("backlightCompensationSupported"),
        WebcamDLL.C_BOOL.withName("backlightCompensationDefault"),
        WebcamDLL.C_BOOL.withName("gainSupported"),
        MemoryLayout.paddingLayout(3),
        WebcamDLL.C_INT.withName("gainMinimum"),
        WebcamDLL.C_INT.withName("gainMaximum"),
        WebcamDLL.C_INT.withName("gainDefault"),
        WebcamDLL.C_INT.withName("gainStepSize"),
        WebcamDLL.C_BOOL.withName("gainAutomaticAllowed"),
        WebcamDLL.C_BOOL.withName("gainManualAllowed"),
        MemoryLayout.paddingLayout(2),
        WebcamDLL.C_INT.withName("configsCount"),
        MemoryLayout.sequenceLayout(32, WebcamDLL.C_INT).withName("configHandle"),
        MemoryLayout.sequenceLayout(32, WebcamDLL.C_INT).withName("configWidth"),
        MemoryLayout.sequenceLayout(32, WebcamDLL.C_INT).withName("configHeight"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.sequenceLayout(32, WebcamDLL.C_LONG_LONG).withName("configMinInterval"),
        MemoryLayout.sequenceLayout(32, WebcamDLL.C_LONG_LONG).withName("configMaxInterval"),
        MemoryLayout.sequenceLayout(32, WebcamDLL.C_SHORT).withName("configColorDepth"),
        MemoryLayout.sequenceLayout(32, WebcamDLL.C_INT).withName("configFourCC")
    ).withName("camera");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfBoolean valid$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("valid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * _Bool valid
     * }
     */
    public static final OfBoolean valid$layout() {
        return valid$LAYOUT;
    }

    private static final long valid$OFFSET = $LAYOUT.byteOffset(groupElement("valid"));

    /**
     * Offset for field:
     * {@snippet lang=c :
     * _Bool valid
